import React from 'react'

import styles from './Admission.module.css'

export default function Admission () {
  return (
    <div className={styles.root}>
      <h2>
        Подать документы
      </h2>

      <div>
        <p className={styles.desc}>
          Заявления о приеме на обучение и документы, необходимые для поступления, принимаются в сроки, предусмотренные пунктами 17 и 18 Правил приема в НГЛУ.
        </p>

        <p className={styles.address}>
          <svg viewBox="0 0 51 48" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M2.88 38.49c-.52 0-.94.42-.94.94v2.63h-1c-.52 0-.94.42-.94.94v4.06c0 .52.42.94.94.94h48.25c.52 0 .94-.42.94-.94V43c0-.52-.42-.94-.94-.94h-1.01v-2.63c0-.52-.42-.94-.94-.94h-1.53V23.6h1.53c.52 0 .94-.42.94-.94v-2.63h1.01c.52 0 .94-.42.94-.94v-3.88c.01-.06.04-.12.04-.18 0-.11-.06-.2-.1-.3l-.03-.09c-.04-.09-.1-.17-.17-.25-.07-.07-.15-.13-.24-.18-.04-.02-.06-.06-.1-.08l-24-14a.949.949 0 00-.95 0L.47 14.22c-.04.03-.07.06-.11.09-.03.03-.07.05-.1.08-.06.07-.11.14-.15.23-.01.02-.02.03-.03.05-.04.1-.06.22-.07.33 0 .01-.01.02-.01.03v4.06c0 .52.42.94.94.94h1.01v2.63c0 .52.42.94.94.94h1.53v14.9H2.88v-.01zm45.37 5.45v2.19H1.88v-2.19h46.37zm-1.95-3.57v1.7H3.82v-1.7H46.3zM11.04 23.6h4.93v14.9h-4.93V23.6zm28.04 14.89h-4.93V23.6h4.93v14.89zm-6.8 0H29.4V23.6h2.88v14.89zm-4.76 0h-4.93V23.6h4.93v14.89zm-6.8 0h-2.87V23.6h2.87v14.89zm23.11 0h-2.87V23.6h2.87v14.89zM25.06 2.02l20.66 12.07H4.4L25.06 2.02zM1.88 18.15v-2.19h46.37v2.19H1.88zm1.94 3.57v-1.69H46.3v1.69H3.82zm2.47 1.88h2.88v14.9H6.29V23.6z" fill="#2F53EB"/>
          </svg>

          Нижний Новгород, ул. Минина, д. 31а, корпус 4, аудитория 4207
        </p>
      </div>
    </div>
  )
}
